app/views/admin_dashboard/index.html.erb

SELECT COUNT(*) FROM "items"
---
      <h3>📦 Total Items</h3>
      <p><%= Item.count %></p>

SELECT COUNT(*) FROM "items" WHERE "items"."status" = ?  [["status", "Lost"]]
---
      <h3>🔍 Lost Items</h3>
      <p><%= Item.where(status: "Lost").count %></p>