app/controllers/admin_sessions_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."username" = ? LIMIT ?  [["username", "admin"], ["LIMIT", 1]]
---
  def create
    admin = Admin.find_by(username: params[:username])