app/controllers/items_controller.rb

  def index
    @items = Item.all.order(created_at: :desc)
---
SELECT "items".* FROM "items" WHERE (title LIKE '%mobile%' OR category LIKE '%mobile%' OR location LIKE '%mobile%') ORDER BY "items"."created_at" DESC

  def create
    @item = Item.new(item_params)

    if @item.save
---
INSERT INTO "items" ("title", "description", "category", "location", "date_lost_found", "status", "created_at", "updated_at", "contact", "contact_name", "contact_email") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @item = Item.find(params[:id])

    if @item.update(item_params)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "items" SET "location" = ?, "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["location", "library"], ["status", "Found"], ["updated_at", "2026-09-28 17:17:57.131835"], ["id", 4]]

  def claim
    @item = Item.find(params[:id])

    if @item.status == "Found"
      @item.update(status: "Claimed")
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", "Claimed"], ["updated_at", "2026-10-04 16:33:45.276106"], ["id", 9]]